/*
     _____ __    _____
    |     |  |  |_   _|  C++ Object Libraries for IBM i
    |  |  |  |__ _| |_   File:   IFILE/rfile.h
    |_____|_____|_____|  Author: Sergey Chebotarev

*/

#ifndef OLI_IFILE_RFILE_H
#define OLI_IFILE_RFILE_H

#include "IOBJECT/fs.h"

IBMI_NAMESPACE_BEGIN ///////////////////////////////////////////////////////////////////////////////////////////////////





//***** ДЕСКРИПТОР ФАЙЛА СИСТЕМЫ IBM I *********************************************************************************
/*
   ИНВАРИАНТЫ
   1.
*/
class rfile
{
};
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////





IBMI_NAMESPACE_END /////////////////////////////////////////////////////////////////////////////////////////////////////

#endif // OLI_IFILE_RFILE_H

